Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/civil_law/originating_summons.html.txt.tmx
Source language: en
Languages: ga

source: It is a request for more information about the case
ga: Iarratas atá ann ar bhreis faisnéise faoin gcás

source: They can also seek further and better particulars about any matter stated in any pleading
ga: Anuas air sin, féadfaidh siad sonraí breise agus níos fearr a lorg faoin aon cheist a luaitear in aon phléadáil

source: They can apply for the particulars by letter or seek an order from the Court
ga: Féadfaidh siad iarratas a dhéanamh ar na sonraí trí litir nó féadfaidh siad ordú a lorg on gCúirt

source: Further information is available in Rules 7 and 8 of Order 19 of the Rules of the Superior Courts
ga: Tá fáil ar thuilleadh faisnéise i Rialacha 7 agus 8 d’Ordú 19 de Rialacha na nUaschúirteanna

source: Setting down for trial
ga: Triail a chur síos

source: In general, in actions commenced by plenary summons a notice of trial (Form 18 or 19) is served by the plaintiff on the defendant and is set down for trial in the Central Office
ga: Go ginearálta, i gcaingne a gcuireann toghairm iomlánach tús leo, seirbheálann an gearánaí fógra trialach (Foirm 18 nó 19) ar an gcosantóir agus cuirtear síos é le haghaidh trialach sa Lár-Oifig

source: At least 21 days’ notice must be given, unless shorter notice has been agreed
ga: Caithfear ar a laghad fógra 21 lá a thabhairt, mura ndearnadh comhaontú ar fhógra níos giorra

source: A motion to set aside the notice of trial must be brought within 4 days of the service of the notice
ga: Caithfear rún chun fógra trialach a chur i leataobh a thabhairt laistigh de 4 lá i ndiaidh an fógra a sheirbheáil

source: If the plaintiff does not give notice of trial within 6 weeks after the close of the pleadings, or within such extended time as the Court may allow, the defendant may give notice of trial or may apply to the Court to dismiss the action for want of prosecution
ga: Mura dtugann an gearánaí fógra trialach laistigh de 6 seachtaine i ndiaidh go dtugtar na pléadálacha chun críche, nó laistigh den am sínte sin a cheadóidh an Chúirt, féadfaidh an cosantóir fógra trialach a thabhairt nó iarratas a dhéanamh ar an gCúirt chun an chaingean a dhíbhe mar gheall ar easpa ionchúisimh

source: Notice of trial is given before setting down the action for trial
ga: Tugtar fógra trialach sula ndéantar an chaingean a chur síos le haghaidh trialach

source: If the action is not set down by either party within 14 days of notice of trial being served, the notice of trial will no longer be in force
ga: Mura gcuireann ceachtar páirtí an chaingean síos laistigh de 14 lá i ndiaidh gur seirbheáiltear an fógra trialach, ní bheidh an fógra trialach i bhfeidhm a thuilleadh

source: The party setting down the proceedings for trial does so by delivering to the Central Office a copy of the notice of trial together with 2 copies of the whole of the pleadings (and of any letter or notice for particulars and reply to it), one of which is for the use of the judge at the trial
ga: Déanann an páirtí a chuireann na himeachtaí le haghaidh trialach síos amhlaidh trí chóip a sholáthar don Lár-Oifig den fhógra trialach, anuas ar 2 chóip de na pléadálacha iomlána (agus d’aon litir nó fógra do chritéir agus aon fhreagra a tugadh orthu), agus úsáidfidh an breitheamh cóip amháin díobh ag an triail

source: Further information is available in Order 36 of the Rules of the Superior Courts
ga: Tá fáil ar thuilleadh faisnéise in Ordú 36 de Rialacha na nUaschúirteanna

source: When the case is set down for trial, it is assigned to the relevant listing for the type of case
ga: Nuair a cuireadh an cás síos le haghaidh trialach, sanntar é don liostú ábhartha i dtaobh shaghas an cháis

source: Information on listing procedures is available on the Courts Service website
ga: Tá faisnéis ar nósanna imeachta liostaithe ar fáil ar láithreán gréasáin na Seirbhíse Cúirteanna

source: The stamp duty that must be paid when a summons is issued is €190
ga: Is ionann an dleacht stampála nach mór a íoc nuair a eisítear toghairm agus €190

source: The stamp duty for entering an appearance is €60
ga: Is é an dleacht stampála atá le híoc chun láithreas a thaifeadadh €60

source: There is no fee or stamp duty for lodging a defence
ga: Ní ghearrtar aon táille nó dleacht stampála ar chosaint a sheoladh ar aghaidh

source: Further information on High Court fees is available on the Courts Service website
ga: Tá fáil ar bhreis faisnéise ar tháillí na hArd-Chúirte ar láithreán gréasáin na Seirbhíse Cúirteanna

source: Your solicitor and barrister will also charge fees for their services
ga: Gearrfaidh d’aturnae agus d’abhcóide táillí ar a gcuid seirbhísí

source: Further information on High Court procedures, High Court rules and forms is available on the Courts Service website
ga: Tá fáil ar bhreis faisnéise ar nósanna imeachta na hArd-Chúirte, rialacha na hArd-Chúirte agus ar fhoirmeacha ar láithreán gréasáin na Seirbhíse Cúirteanna
